* General
#+begin_src emacs-lisp
  ;; -------------------------------------------------
  (define-prefix-command 'Aux)
  (global-set-key (kbd "C-c z") 'Aux)
  (define-key Aux (kbd "c") '(lambda () (interactive) (find-file "~/.emacs.d/dotfiles/.emacs")))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (find-file ~/.emacs.d/dotfiles/.emacs) |

